[
  {
    "name": "Архітектура обчислювальної системи. Класифікація комп’ютерів",
    "subtopics": [
      {
        "name": "Архітектура фон-Неймана",
        "content": "Архітекту́ра фон Неймана (англ. Von Neumann architecture) — архітектура електронних обчислювальних машин, основною відмінністю якої від інших подібних архітектур є спільне зберігання даних та машинних команд в комірках однієї й тієї ж пам'яті, що унеможливлює їх розрізнення за способом представлення або кодування. Названа так на честь відомого математика та теоретика обчислювальної техніки Джона фон Неймана, та по сьогодні залишається домінуючою схемою організації ЕОМ загального призначення."
      },
      {
        "name": "Гарвардська архітектура",
        "content": "ВЕЛИКИЙ ГЕТСБІ\n\nРОЗДІЛ ПЕРШИЙ\n\nЩе будучи зеленим і вразливим юнаком, я дістав від батька пораду, яку запам'ятав на все життя.\n\n— Щоразу, коли тобі раптом захочеться когось осудити,— сказав він,— згадуй, що не кожному на цім світі випали переваги, які маєш ти.\n\nВін нічого не додав до цього, але ми з ним завжди розуміли один одного з півслова, і мені ясно було, що він має на думці набагато більше. Отож я привчив себе не квапитися з висновками і завдяки цій звичці не раз здобував прихильність людей пересічних, а ще частіше ставав жертвою невиправних зануд. Хвороблива натура швидко вловлює і зразу ж намагається використати вияв терпимості з боку людини цілком нормальної; ще в коледжі мені несправедливо закидали потяг до дешевої популярності через те, що найбільш вовкуваті й замкнуті хлопці звіряли мені свої потаємні жалі. Я зовсім не домагався такої відвертості — навпаки, помітивши в голосі співрозмовника перші нотки довірчих одкровень, я, бувало, вдавав, що хочу спати, чи поспішаю кудись, чи переходив на такий собі задерикувато-легковажний тон; адже, виливаючи душу, молоді люди, як правило, не добирають своїх власних слів, а говорять з чужого голосу і до того ж, на жаль, з явними недомовками.\n\nСтриманість у судженнях вселяє невичерпну надію. Я й досі побоююся прогавити щось, якщо забуду батькове снобістське зауваження — яке я по-снобістському повторюю — про те, що природа наділяє людей різним розумінням дозволеного і недозволеного.\n\nА тепер, похвалившись своєю терпимістю, я мушу зізнатися, що вона не безмежна. Поведінка людини може грунтуватися на засадах твердих, як камінь, чи хлипких, як твань, але часом настає і така мить, коли мене вже не обходить, на чому вона грунтується. Минулої осені, коли я повернувся з Нью-Йорка, мені хотілося, щоб людство стало на варту своїх моральних цінностей, як затягнутий у мундир солдат. З мене досить уже було розгульних екскурсій з відвіданням потаємних закутків людської душі. Тільки для Гетсбі, людини, ім'ям якої названа ця книжка, я робив виняток,— для Гетсбі, котрий уособлював усе те, що я глибоко зневажаю. Якщо міряти особистість напругою її поривань, то він був особистістю надзвичайною, наділеною якоюсь загостреною чутливістю до всього, що може пообіцяти йому життя; він був немовби частиною одного з тих складних приладів, що реєструють підземні поштовхи на відстані десятків тисяч миль. Чутливість ця не мала нічого спільного з млявою вразливістю, яку гучно іменують \"артистичною вдачею\",— це була рідкісна здатність надіятися, романтичний запал, якого я ні в кому більше не зустрічав і, певне, вже ніколи не зустріну. Ні, Гетсбі наостанку виправдав себе; не він, а те, що тяжіло над ним, та отруйна курява, яку здіймали крила його мрії,— ось що на час позбавило мене інтересу до людських перебіжних печалей та скороминущих радощів.\n\nЯ належу до заможної родини, яка от уже в третьому поколінні відіграє значну роль у житті нашого середньозахідного міста. Каррауеї — це, власне, цілий клан, що, за родинними переказами, походить від герцогів Баклу, але наша парость бере початок фактично від дідового брата, який приїхав сюди 1851 року, відкупився від участі в Громадянській війні й налагодив оптову торгівлю залізним товаром, яку тепер провадить мій батько.\n\nЯ ніколи не бачив свого двоюрідного діда, але кажуть, ніби я схожий на нього — засвідчувати це має його досить грубий портрет, що висить у батьковому кабінеті.\n\n1915 року, рівно через двадцять п'ять років після мого батька, я завершив вищу освіту в Нью-Хейвені, [1] а трохи згодом узяв участь у тій запізнілій міграції тевтонських племен, яку заведено називати Великою світовою війною. Похідне життя так захопило мене, що, повернувшись додому, я вже не міг всидіти на місці. Рідний штат здавався мені тепер не славним осереддям всесвіту, а, скоріш, його пощербленим краєм; тим-то я вирішив податися на Схід і вивчитися на біржовика. Всі мої знайомі жили з біржі — тож невже вона не прогодує ще одного самотнього чоловіка? Мої численні тітки й дядьки обговорювали це питання так заклопотано, наче йшлося про вибір для мене початкової школи, і нарешті дуже поважно й не дуже впевнено виголосили: \"Власне, чом би й ні...\" Батько погодився протягом року оплачувати мої рахунки, і ось після всіляких непередбачених затримок я навесні 1922 року приїхав до Нью-Йорка, як мені здавалося тоді,— назавжди.\n\nМені, звісно, слід було б найняти помешкання в самому місті, але наближалося літо, а я прибув з краю просторих травників і тінистих дерев, і тому, коли один молодий колега по конторі запропонував найняти вдвох помешкання де-небудь у передмісті, я радо пристав на це. Він підшукав обшарпаний дачний будиночок за вісімдесят доларів на місяць, але в останню хвилину фірма відрядила його до Вашингтона й мені довелось оселитися там самому. Я завів собаку — щоправда, всього на кілька днів, бо потім він утік,— купив старенький \"додж\" і найняв служницю, фінку, яка стелила мені ліжко й готувала на електричній плитці сніданок, бормочучи собі під ніс якісь фінські мудрощі."
      },
      {
        "name": "Гібридні модифікації з архітектурою фон - Неймана",
        "content": "Текст для Гібридні модифікації з архітектурою фон - Неймана"
      }
    ]
  },
  {
    "name": "Архітектура системи команд",
    "subtopics": [
      {
        "name": "Конвеєрна архітектура виконання команд.",
        "content": "Текст для Конвеєрна архітектура виконання команд."
      },
      {
        "name": "Паралельна архітектура.",
        "content": "Текст для Паралельна архітектура."
      },
      {
        "name": "Закон Амдала.",
        "content": "Текст для Закон Амдала."
      }
    ]
  }
]
